{
  "WHO_AM_I_TITLE": "Who am I?",
  "WHO_AM_I_TEXT": "Fourth year student in five year engineering degree at the <b>University of Technology of Troyes</b> in Informatics et Information Systems, I love computer science and programming.",
  "SKILLS_TITLE": "My skills",
  "PROJECTS_TITLE": "My projects",
  "CONTACT_TITLE": "Contact",
  "CONTACT_EMAIL_TEXT": "You can reach me at the following e-mail address",
  "CONTACT_RESUME_TEXT": "My resume is also available here",
  "CONTACT_RESUME_ALONE": "My resume",
  "PROJECTS_INTRO_TEXT": "Here are some projects I've worked on as side projects or as courses projects. Click on a project icon to see some details or access the source code !",
  "VIEW_SOURCE_CODE": "View source code",
  "SKILLS_TEXT_1": "Self-taught in software developement since I was 14, I have been able to develop skill on many fields (software developement, security, data structures...) that are strengthened with my engineering degree in computer science.",
  "SKILLS_TEXT_2": "I have a good level with <b>Typescript</b> (Node / Web) and <b>Java</b> more specifically, and am able to adapt to every programming language.",
  "PROJECT_PERSONAL_ROLE_TITLE": "My role in project",
  "PROJECT_MADE_IN_TEXT": "Made in",
  "LAST_UPDATED": "last updated on",
  "projects": {
    "portfolio": {
      "description": "That's the website you're currently on ! It was created with Angular and Bootstrap to give more information about me and the projects I made thoughout my journey in computer science."
    },
    "perceval": {
      "description": "Simple app made in a course project of robot building. It was created in order to control the robot remotely with bluetooth.\n\nIt has two modes available :\n- Manual control mode : allow to give movement order to the robot with the computer's keyboard, these commands are recorded to be used in the second mode\n- Playback mode : take a previous command recording and reproduce the same sequence.\n\nBluetooth has been used to compensate the lack of electronical supplies, allowing to store data on the computer instead of hard-coding the sequence every time. Recording data was the adopted solution because of the irregularity of the ground and the unability to make proper position control with the given supplies."
    },
    "perlin": {
      "description": "High school project for a software developement introduction course.\nIt is a basic car game made in Java made with Processing.\n\nThe complex part about this project was the collision system, created from scratch with the math knowledge I had back then."
    },
    "awekato": {
      "description": "Web OS (\"operating system\" like service on the web) made as a personal project using almost the same structure as a Linux system."
    },
    "quarotte": {
      "description": "Group project in a project management course. It is a command line tool to process data from many of mails to produce visual data.",
      "role": "Developement of a module to parse mail to retrieve required data for the tool."
    },
    "nfcompile": {
      "description": "Language interpreter project. It was a personal challenge to make a language used in a algorithm introduction course runnable.\n\nIt create a tree similar to a abstract syntax tree to parse the code."
    },
    "8americain": {
      "description": "It is a Crazy Eights (called \"8 Américain\" in France) implementation in Java with many variations. These variations are added through \"definition\" files and can be modified without editing the source code."
    },
    "robotik": {
      "description": "High-level software part of a robot designed with the robotic association of the UTT. Powered with ROS ([Robot Operating System](http://www.ros.org/)), it handles many data (from sensors, action made et to be done) in order to give directions to the robot.\n\nIt was build for the [coupe de france de robotique 2019](https://www.coupederobotique.fr/) (a robotics cup between students in France).",
      "role": "Take up of the previous code and improvements (in C++ and Python) :\n- Code refactoring (more modular code, removing redundant code...)\n- Implementation of a decision tree defined in XML configuration files\n- Handling of new sensors and actuators\n- Unit testing for most complex or important parts of the project"
    }
  }
}
