{
  "WHO_AM_I_TITLE": "Qui suis je?",
  "WHO_AM_I_TEXT": "Étudiant en 2ème année de cycle ingénieur à l'<b>Université de Technologie de Troyes</b> en Informatique et Système d'Information. Je suis passioné d'informatique et de programmation en général.",
  "SKILLS_TITLE": "Mes compétences et intérets",
  "PROJECTS_TITLE": "Mes projets",
  "CONTACT_TITLE": "Contact",
  "CONTACT_EMAIL_TEXT": "Vous pouvez me contacter par mail à l'adresse suivante",
  "CONTACT_RESUME_TEXT": "Mon CV est également disponible ici",
  "CONTACT_RESUME_ALONE": "Mon CV",
  "PROJECTS_INTRO_TEXT": "Voici quelques projets que j'ai pu réaliser personnellement ou dans le cadre de mes études.",
  "VIEW_SOURCE_CODE": "Accès au code source",
  "SKILLS_TEXT_1": "Autodidacte depuis l'âge de 14 ans, j'ai pu développer des compétences sur de nombreux domaines (développement, sécurité, formats de données...), mais également les renforcer par ma formation d'ingénieur en informatique.",
  "PROJECT_PERSONAL_ROLE_TITLE": "Mon rôle dans le projet",
  "PROJECT_MADE_IN_TEXT": "Réalisé en",
  "LAST_UPDATED": "mis à jour le",
  "CP_TITLE": "Concours et challenges informatique",
  "CP_TEXT": "Je participe régulièrement à des compétitions ou challenges de programmation, en voici quelques uns.",
  "OUT_OF": "sur",
  "RESULTS": "Résultats",
  "CONTEST_DETAILS": "Détails sur le concours",
  "studies": "Formations",
  "experiences": "Expériences",
  "skills": {
    "titles": {
      "interests": "Intérêts",
      "environment": "Environnements",
      "technos": "Technos"
    },
    "items": {
      "code-analysis": "Je suis passionné par toutes les méthodes d'analyse ou de génération de code (compilateurs, générateurs de code, outils d'analyse de code...)",
      "frameworks": "Concevoir un comportement générique dans un programme, pour qu'il puisse être utilisé simplement plus tard, est vraiment quelque chose qu'il m'est intéressant de faire"
    }
  },
  "contests": {
    "it-axa": "Meilleur étudiant en informatique de France",
    "java-gfi": "Java Challenge France by Gfi Informatique",
    "battledev": "Battle Dev",
    "codingbattle": "Coding Battle / Le Shaker",
    "dotnet-softfluent": ".Net Challenge France"
  },
  "projects": {
    "portfolio": {
      "title": "Ce portfolio",
      "description": "Site vitrine présentant mes différents projets et mes compétences."
    },
    "perceval": {
      "title": "Contrôle de robot",
      "description": "Application réalisée dans le cadre d'une UE de conception de robot. Elle permet de controler le robot à distance via bluetooth.\n\nDeux modes de fonctionnement sont disponibles :\n- Mode manuel : permet de donner manuellement les ordres au robot, ces derniers sont enregistrés au fur et à mesure pour le second mode\n- Mode playback : reprends un enregistrement d'ordre pour le reproduire à l'identique.\n\nLe bluetooth a été utilisé pour palier au manque de matériel et donc de moyens d'enregistrement des données sur le robot. L'enregistrement est une solution choisie pour pallier à l'irrégularité du sol et l'impossibilité de faire un asservissement avec le matériel donné."
    },
    "perlin": {
      "title": "Jeu avec système de collision 2D",
      "description": "Projet de terminale pour la spécialité ISN.\nJeu de voiture réalisé en java."
    },
    "quarotte": {
      "title": "Outil en ligne de commande",
      "description": "Projet de groupe réalisé dans le cadre d'une <abbr title=\"unité d'enseignement, matière suivie durant un semestre\">UE</abbr> de gestion de projet. Outil en ligne de commande de traitement de données issues de mails.",
      "role": "Création d'un module pour parser des mails et récupérer les données nécessaires à l'outil."
    },
    "nfcompile": {
      "title": "Interpréteur de langage",
      "description": "Projet d'interpréteur de langage de programmation utilisé dans le cadre d'un cours d'algorithmique."
    },
    "8americain": {
      "title": "Jeu de carte paramétrable",
      "description": "8 américain en java avec de nombreuses variantes. Ces dernières sont implémentées et peuvent être ajoutées en modifiant des fichiers de définition de variantes."
    },
    "robotik": {
      "title": "Automatisme de robot par arbre d'action",
      "description": "Partie haut niveau du gros robot de l'association de robotique de l'UTT. Développée à l'aide de ROS ([Robot Operating System](http://www.ros.org/)), elle gère les différentes informations (capteurs, action réalisées et à réaliser) afin de diriger le robot.\n\nCe robot est construit dans l'objectif de participer à la [coupe de france de robotique 2019](https://www.coupederobotique.fr/).",
      "role": "Reprise du code de l'ancien robot et améliorations :\n- Restructuration du code (modularisation, suppression de code redondants...)\n- Mise en place d'un arbre d'action pour la décision\n- Adaptation aux nouveaux actionneurs et capteurs"
    },
    "duck": {
      "title": "Framework de Remote call procedure",
      "description": "Framework permettant de définir des objets distants (hébergés par un autre ordinateur ou programme) dont les attributs et méthodes peuvent appelés à travers le réseau.\n\nLes types d'objets sont décris dans un fichier, qui est ensuite parsé par un script javascript qui génère ensuite le code de chacun des objets définis en kotlin.\n\nLe framework a été pensé de façon à ce que du point de vue de l'utilisateur (le développeur), il n'y ai pas besoin de distinguer les objets distants et locaux, le même code est écrit dans les deux cas et les appels distants sont gérés automatiquement par la librairie."
    }
  },
  "exps": {
    "utt": {
      "name": "Université de technologie de Troyes",
      "description": "Formation d'ingénieur de 5 ans, en Informatique et Systèmes d'Informations",
      "location": "Troyes, France"
    },
    "utseus": {
      "name": "Shanghai University",
      "description": "Semestre d'études à l'étranger",
      "location": "Shanghai, Chine"
    },
    "ntu": {
      "name": "Nanyang Technological University",
      "description": "Semestre d'études à l'étranger",
      "location": "Singapour"
    },
    "bytel": {
      "company": "Bouygues Telecom",
			"role": "Développeur Java / Angular",
			"location": "Nantes, France",
      "description": "Développement d'outils de visualisation de micro-services"
    },
    "robotik": {
      "company": "Association Robotik UTT",
			"role": "Développeur ROS",
			"location": "Troyes, France",
			"description": "Développement de l'automatisme d'un robot autonome en C++ et python"
    }
  }
}
